examples/test_examples_output/exgentic_appworld_07.graph.dot
digraph causalguard {
  rankdir=LR;
  "llm:2a21e94e0687_54c78d84:span:0b0aa10011c25272:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:0b0aa10011c25272:llm"];
  "llm:2a21e94e0687_54c78d84:span:0c436af9d70e4b9c:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:0c436af9d70e4b9c:llm"];
  "llm:2a21e94e0687_54c78d84:span:0e77523af85f16ae:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:0e77523af85f16ae:llm"];
  "llm:2a21e94e0687_54c78d84:span:0eaf4f86ecb8b573:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:0eaf4f86ecb8b573:llm"];
  "llm:2a21e94e0687_54c78d84:span:1847a6ad339b06d6:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:1847a6ad339b06d6:llm"];
  "llm:2a21e94e0687_54c78d84:span:1d5bf1efefcfd157:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:1d5bf1efefcfd157:llm"];
  "llm:2a21e94e0687_54c78d84:span:21599fd42654e452:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:21599fd42654e452:llm"];
  "llm:2a21e94e0687_54c78d84:span:273b0d68a2437493:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:273b0d68a2437493:llm"];
  "llm:2a21e94e0687_54c78d84:span:276b2820f06050fb:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:276b2820f06050fb:llm"];
  "llm:2a21e94e0687_54c78d84:span:2fb3778987d0dea9:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:2fb3778987d0dea9:llm"];
  "llm:2a21e94e0687_54c78d84:span:3099f3232895f9c1:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:3099f3232895f9c1:llm"];
  "llm:2a21e94e0687_54c78d84:span:3ac44c55b59e2e72:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:3ac44c55b59e2e72:llm"];
  "llm:2a21e94e0687_54c78d84:span:422a77d488a2cfd8:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:422a77d488a2cfd8:llm"];
  "llm:2a21e94e0687_54c78d84:span:4436886971683add:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:4436886971683add:llm"];
  "llm:2a21e94e0687_54c78d84:span:49e2107b9042b65c:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:49e2107b9042b65c:llm"];
  "llm:2a21e94e0687_54c78d84:span:4a110ff398df43a0:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:4a110ff398df43a0:llm"];
  "llm:2a21e94e0687_54c78d84:span:4cc55d33ae1b8d36:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:4cc55d33ae1b8d36:llm"];
  "llm:2a21e94e0687_54c78d84:span:4e896bab65cf634f:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:4e896bab65cf634f:llm"];
  "llm:2a21e94e0687_54c78d84:span:539db7100d339b1a:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:539db7100d339b1a:llm"];
  "llm:2a21e94e0687_54c78d84:span:66da95225945c5fd:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:66da95225945c5fd:llm"];
  "llm:2a21e94e0687_54c78d84:span:7371c38211dccc19:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:7371c38211dccc19:llm"];
  "llm:2a21e94e0687_54c78d84:span:7b383445da75cb4b:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:7b383445da75cb4b:llm"];
  "llm:2a21e94e0687_54c78d84:span:87d84995b3ca4ea1:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:87d84995b3ca4ea1:llm"];
  "llm:2a21e94e0687_54c78d84:span:9cd14a83f32b9e32:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:9cd14a83f32b9e32:llm"];
  "llm:2a21e94e0687_54c78d84:span:b583cb58a87f68eb:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:b583cb58a87f68eb:llm"];
  "llm:2a21e94e0687_54c78d84:span:bd281276277d9bc3:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:bd281276277d9bc3:llm"];
  "llm:2a21e94e0687_54c78d84:span:de4198591cfd11e0:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:de4198591cfd11e0:llm"];
  "llm:2a21e94e0687_54c78d84:span:e0b972d19512e73e:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:e0b972d19512e73e:llm"];
  "llm:2a21e94e0687_54c78d84:span:e854dfefc11fe510:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:e854dfefc11fe510:llm"];
  "llm:2a21e94e0687_54c78d84:span:f1f94186aafc2ba1:llm" [label="llm_invocation: llm:2a21e94e0687_54c78d84:span:f1f94186aafc2ba1:llm"];
  "tool:2a21e94e0687_54c78d84:span:0b0aa10011c25272:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:0b0aa10011c25272:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:0c436af9d70e4b9c:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:0c436af9d70e4b9c:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:0e77523af85f16ae:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:0e77523af85f16ae:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:0eaf4f86ecb8b573:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:0eaf4f86ecb8b573:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:1847a6ad339b06d6:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:1847a6ad339b06d6:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:1d5bf1efefcfd157:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:1d5bf1efefcfd157:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:21599fd42654e452:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:21599fd42654e452:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:273b0d68a2437493:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:273b0d68a2437493:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:276b2820f06050fb:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:276b2820f06050fb:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:2fb3778987d0dea9:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:2fb3778987d0dea9:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:3099f3232895f9c1:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:3099f3232895f9c1:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:3ac44c55b59e2e72:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:3ac44c55b59e2e72:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:4436886971683add:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:4436886971683add:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:49e2107b9042b65c:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:49e2107b9042b65c:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:4a110ff398df43a0:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:4a110ff398df43a0:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:4cc55d33ae1b8d36:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:4cc55d33ae1b8d36:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:4e896bab65cf634f:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:4e896bab65cf634f:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:539db7100d339b1a:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:539db7100d339b1a:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:66da95225945c5fd:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:66da95225945c5fd:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:7371c38211dccc19:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:7371c38211dccc19:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:7b383445da75cb4b:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:7b383445da75cb4b:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:87d84995b3ca4ea1:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:87d84995b3ca4ea1:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:9cd14a83f32b9e32:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:9cd14a83f32b9e32:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:b583cb58a87f68eb:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:b583cb58a87f68eb:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:bd281276277d9bc3:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:bd281276277d9bc3:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:de4198591cfd11e0:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:de4198591cfd11e0:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:e0b972d19512e73e:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:e0b972d19512e73e:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:e854dfefc11fe510:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:e854dfefc11fe510:tool:0"];
  "tool:2a21e94e0687_54c78d84:span:f1f94186aafc2ba1:tool:0" [label="tool_call: tool:2a21e94e0687_54c78d84:span:f1f94186aafc2ba1:tool:0"];
  "llm:2a21e94e0687_54c78d84:span:0b0aa10011c25272:llm" -> "tool:2a21e94e0687_54c78d84:span:0b0aa10011c25272:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:0b0aa10011c25272:llm:2a21e94e0687_54c78d84:span:0b0aa10011c25272:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:0c436af9d70e4b9c:llm" -> "tool:2a21e94e0687_54c78d84:span:0c436af9d70e4b9c:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:0c436af9d70e4b9c:llm:2a21e94e0687_54c78d84:span:0c436af9d70e4b9c:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:0e77523af85f16ae:llm" -> "tool:2a21e94e0687_54c78d84:span:0e77523af85f16ae:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:0e77523af85f16ae:llm:2a21e94e0687_54c78d84:span:0e77523af85f16ae:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:0eaf4f86ecb8b573:llm" -> "tool:2a21e94e0687_54c78d84:span:0eaf4f86ecb8b573:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:0eaf4f86ecb8b573:llm:2a21e94e0687_54c78d84:span:0eaf4f86ecb8b573:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:1847a6ad339b06d6:llm" -> "tool:2a21e94e0687_54c78d84:span:1847a6ad339b06d6:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:1847a6ad339b06d6:llm:2a21e94e0687_54c78d84:span:1847a6ad339b06d6:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:1d5bf1efefcfd157:llm" -> "tool:2a21e94e0687_54c78d84:span:1d5bf1efefcfd157:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:1d5bf1efefcfd157:llm:2a21e94e0687_54c78d84:span:1d5bf1efefcfd157:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:21599fd42654e452:llm" -> "tool:2a21e94e0687_54c78d84:span:21599fd42654e452:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:21599fd42654e452:llm:2a21e94e0687_54c78d84:span:21599fd42654e452:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:273b0d68a2437493:llm" -> "tool:2a21e94e0687_54c78d84:span:273b0d68a2437493:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:273b0d68a2437493:llm:2a21e94e0687_54c78d84:span:273b0d68a2437493:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:276b2820f06050fb:llm" -> "tool:2a21e94e0687_54c78d84:span:276b2820f06050fb:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:276b2820f06050fb:llm:2a21e94e0687_54c78d84:span:276b2820f06050fb:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:2fb3778987d0dea9:llm" -> "tool:2a21e94e0687_54c78d84:span:2fb3778987d0dea9:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:2fb3778987d0dea9:llm:2a21e94e0687_54c78d84:span:2fb3778987d0dea9:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:3099f3232895f9c1:llm" -> "tool:2a21e94e0687_54c78d84:span:3099f3232895f9c1:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:3099f3232895f9c1:llm:2a21e94e0687_54c78d84:span:3099f3232895f9c1:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:3ac44c55b59e2e72:llm" -> "tool:2a21e94e0687_54c78d84:span:3ac44c55b59e2e72:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:3ac44c55b59e2e72:llm:2a21e94e0687_54c78d84:span:3ac44c55b59e2e72:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:4436886971683add:llm" -> "tool:2a21e94e0687_54c78d84:span:4436886971683add:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:4436886971683add:llm:2a21e94e0687_54c78d84:span:4436886971683add:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:49e2107b9042b65c:llm" -> "tool:2a21e94e0687_54c78d84:span:49e2107b9042b65c:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:49e2107b9042b65c:llm:2a21e94e0687_54c78d84:span:49e2107b9042b65c:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:4a110ff398df43a0:llm" -> "tool:2a21e94e0687_54c78d84:span:4a110ff398df43a0:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:4a110ff398df43a0:llm:2a21e94e0687_54c78d84:span:4a110ff398df43a0:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:4cc55d33ae1b8d36:llm" -> "tool:2a21e94e0687_54c78d84:span:4cc55d33ae1b8d36:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:4cc55d33ae1b8d36:llm:2a21e94e0687_54c78d84:span:4cc55d33ae1b8d36:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:4e896bab65cf634f:llm" -> "tool:2a21e94e0687_54c78d84:span:4e896bab65cf634f:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:4e896bab65cf634f:llm:2a21e94e0687_54c78d84:span:4e896bab65cf634f:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:539db7100d339b1a:llm" -> "tool:2a21e94e0687_54c78d84:span:539db7100d339b1a:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:539db7100d339b1a:llm:2a21e94e0687_54c78d84:span:539db7100d339b1a:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:66da95225945c5fd:llm" -> "tool:2a21e94e0687_54c78d84:span:66da95225945c5fd:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:66da95225945c5fd:llm:2a21e94e0687_54c78d84:span:66da95225945c5fd:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:7371c38211dccc19:llm" -> "tool:2a21e94e0687_54c78d84:span:7371c38211dccc19:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:7371c38211dccc19:llm:2a21e94e0687_54c78d84:span:7371c38211dccc19:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:7b383445da75cb4b:llm" -> "tool:2a21e94e0687_54c78d84:span:7b383445da75cb4b:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:7b383445da75cb4b:llm:2a21e94e0687_54c78d84:span:7b383445da75cb4b:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:87d84995b3ca4ea1:llm" -> "tool:2a21e94e0687_54c78d84:span:87d84995b3ca4ea1:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:87d84995b3ca4ea1:llm:2a21e94e0687_54c78d84:span:87d84995b3ca4ea1:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:9cd14a83f32b9e32:llm" -> "tool:2a21e94e0687_54c78d84:span:9cd14a83f32b9e32:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:9cd14a83f32b9e32:llm:2a21e94e0687_54c78d84:span:9cd14a83f32b9e32:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:b583cb58a87f68eb:llm" -> "tool:2a21e94e0687_54c78d84:span:b583cb58a87f68eb:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:b583cb58a87f68eb:llm:2a21e94e0687_54c78d84:span:b583cb58a87f68eb:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:bd281276277d9bc3:llm" -> "tool:2a21e94e0687_54c78d84:span:bd281276277d9bc3:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:bd281276277d9bc3:llm:2a21e94e0687_54c78d84:span:bd281276277d9bc3:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:de4198591cfd11e0:llm" -> "tool:2a21e94e0687_54c78d84:span:de4198591cfd11e0:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:de4198591cfd11e0:llm:2a21e94e0687_54c78d84:span:de4198591cfd11e0:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:e0b972d19512e73e:llm" -> "tool:2a21e94e0687_54c78d84:span:e0b972d19512e73e:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:e0b972d19512e73e:llm:2a21e94e0687_54c78d84:span:e0b972d19512e73e:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:e854dfefc11fe510:llm" -> "tool:2a21e94e0687_54c78d84:span:e854dfefc11fe510:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:e854dfefc11fe510:llm:2a21e94e0687_54c78d84:span:e854dfefc11fe510:tool:0\nparent_event/high"];
  "llm:2a21e94e0687_54c78d84:span:f1f94186aafc2ba1:llm" -> "tool:2a21e94e0687_54c78d84:span:f1f94186aafc2ba1:tool:0" [label="invokes\nedge:parent:invokes:2a21e94e0687_54c78d84:span:f1f94186aafc2ba1:llm:2a21e94e0687_54c78d84:span:f1f94186aafc2ba1:tool:0\nparent_event/high"];
}
