examples/test_examples_output/exgentic_appworld_07.graph.mmd
flowchart LR
  n0["llm_invocation: llm:2a21e94e0687_54c78d84:span:0b0aa10011c25272:llm"]
  n1["llm_invocation: llm:2a21e94e0687_54c78d84:span:0c436af9d70e4b9c:llm"]
  n2["llm_invocation: llm:2a21e94e0687_54c78d84:span:0e77523af85f16ae:llm"]
  n3["llm_invocation: llm:2a21e94e0687_54c78d84:span:0eaf4f86ecb8b573:llm"]
  n4["llm_invocation: llm:2a21e94e0687_54c78d84:span:1847a6ad339b06d6:llm"]
  n5["llm_invocation: llm:2a21e94e0687_54c78d84:span:1d5bf1efefcfd157:llm"]
  n6["llm_invocation: llm:2a21e94e0687_54c78d84:span:21599fd42654e452:llm"]
  n7["llm_invocation: llm:2a21e94e0687_54c78d84:span:273b0d68a2437493:llm"]
  n8["llm_invocation: llm:2a21e94e0687_54c78d84:span:276b2820f06050fb:llm"]
  n9["llm_invocation: llm:2a21e94e0687_54c78d84:span:2fb3778987d0dea9:llm"]
  n10["llm_invocation: llm:2a21e94e0687_54c78d84:span:3099f3232895f9c1:llm"]
  n11["llm_invocation: llm:2a21e94e0687_54c78d84:span:3ac44c55b59e2e72:llm"]
  n12["llm_invocation: llm:2a21e94e0687_54c78d84:span:422a77d488a2cfd8:llm"]
  n13["llm_invocation: llm:2a21e94e0687_54c78d84:span:4436886971683add:llm"]
  n14["llm_invocation: llm:2a21e94e0687_54c78d84:span:49e2107b9042b65c:llm"]
  n15["llm_invocation: llm:2a21e94e0687_54c78d84:span:4a110ff398df43a0:llm"]
  n16["llm_invocation: llm:2a21e94e0687_54c78d84:span:4cc55d33ae1b8d36:llm"]
  n17["llm_invocation: llm:2a21e94e0687_54c78d84:span:4e896bab65cf634f:llm"]
  n18["llm_invocation: llm:2a21e94e0687_54c78d84:span:539db7100d339b1a:llm"]
  n19["llm_invocation: llm:2a21e94e0687_54c78d84:span:66da95225945c5fd:llm"]
  n20["llm_invocation: llm:2a21e94e0687_54c78d84:span:7371c38211dccc19:llm"]
  n21["llm_invocation: llm:2a21e94e0687_54c78d84:span:7b383445da75cb4b:llm"]
  n22["llm_invocation: llm:2a21e94e0687_54c78d84:span:87d84995b3ca4ea1:llm"]
  n23["llm_invocation: llm:2a21e94e0687_54c78d84:span:9cd14a83f32b9e32:llm"]
  n24["llm_invocation: llm:2a21e94e0687_54c78d84:span:b583cb58a87f68eb:llm"]
  n25["llm_invocation: llm:2a21e94e0687_54c78d84:span:bd281276277d9bc3:llm"]
  n26["llm_invocation: llm:2a21e94e0687_54c78d84:span:de4198591cfd11e0:llm"]
  n27["llm_invocation: llm:2a21e94e0687_54c78d84:span:e0b972d19512e73e:llm"]
  n28["llm_invocation: llm:2a21e94e0687_54c78d84:span:e854dfefc11fe510:llm"]
  n29["llm_invocation: llm:2a21e94e0687_54c78d84:span:f1f94186aafc2ba1:llm"]
  n30["tool_call: tool:2a21e94e0687_54c78d84:span:0b0aa10011c25272:tool:0"]
  n31["tool_call: tool:2a21e94e0687_54c78d84:span:0c436af9d70e4b9c:tool:0"]
  n32["tool_call: tool:2a21e94e0687_54c78d84:span:0e77523af85f16ae:tool:0"]
  n33["tool_call: tool:2a21e94e0687_54c78d84:span:0eaf4f86ecb8b573:tool:0"]
  n34["tool_call: tool:2a21e94e0687_54c78d84:span:1847a6ad339b06d6:tool:0"]
  n35["tool_call: tool:2a21e94e0687_54c78d84:span:1d5bf1efefcfd157:tool:0"]
  n36["tool_call: tool:2a21e94e0687_54c78d84:span:21599fd42654e452:tool:0"]
  n37["tool_call: tool:2a21e94e0687_54c78d84:span:273b0d68a2437493:tool:0"]
  n38["tool_call: tool:2a21e94e0687_54c78d84:span:276b2820f06050fb:tool:0"]
  n39["tool_call: tool:2a21e94e0687_54c78d84:span:2fb3778987d0dea9:tool:0"]
  n40["tool_call: tool:2a21e94e0687_54c78d84:span:3099f3232895f9c1:tool:0"]
  n41["tool_call: tool:2a21e94e0687_54c78d84:span:3ac44c55b59e2e72:tool:0"]
  n42["tool_call: tool:2a21e94e0687_54c78d84:span:4436886971683add:tool:0"]
  n43["tool_call: tool:2a21e94e0687_54c78d84:span:49e2107b9042b65c:tool:0"]
  n44["tool_call: tool:2a21e94e0687_54c78d84:span:4a110ff398df43a0:tool:0"]
  n45["tool_call: tool:2a21e94e0687_54c78d84:span:4cc55d33ae1b8d36:tool:0"]
  n46["tool_call: tool:2a21e94e0687_54c78d84:span:4e896bab65cf634f:tool:0"]
  n47["tool_call: tool:2a21e94e0687_54c78d84:span:539db7100d339b1a:tool:0"]
  n48["tool_call: tool:2a21e94e0687_54c78d84:span:66da95225945c5fd:tool:0"]
  n49["tool_call: tool:2a21e94e0687_54c78d84:span:7371c38211dccc19:tool:0"]
  n50["tool_call: tool:2a21e94e0687_54c78d84:span:7b383445da75cb4b:tool:0"]
  n51["tool_call: tool:2a21e94e0687_54c78d84:span:87d84995b3ca4ea1:tool:0"]
  n52["tool_call: tool:2a21e94e0687_54c78d84:span:9cd14a83f32b9e32:tool:0"]
  n53["tool_call: tool:2a21e94e0687_54c78d84:span:b583cb58a87f68eb:tool:0"]
  n54["tool_call: tool:2a21e94e0687_54c78d84:span:bd281276277d9bc3:tool:0"]
  n55["tool_call: tool:2a21e94e0687_54c78d84:span:de4198591cfd11e0:tool:0"]
  n56["tool_call: tool:2a21e94e0687_54c78d84:span:e0b972d19512e73e:tool:0"]
  n57["tool_call: tool:2a21e94e0687_54c78d84:span:e854dfefc11fe510:tool:0"]
  n58["tool_call: tool:2a21e94e0687_54c78d84:span:f1f94186aafc2ba1:tool:0"]
  n0 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:0b0aa10011c25272:llm:2a21e94e0687_54c78d84:span:0b0aa10011c25272:tool:0"| n30
  n1 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:0c436af9d70e4b9c:llm:2a21e94e0687_54c78d84:span:0c436af9d70e4b9c:tool:0"| n31
  n2 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:0e77523af85f16ae:llm:2a21e94e0687_54c78d84:span:0e77523af85f16ae:tool:0"| n32
  n3 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:0eaf4f86ecb8b573:llm:2a21e94e0687_54c78d84:span:0eaf4f86ecb8b573:tool:0"| n33
  n4 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:1847a6ad339b06d6:llm:2a21e94e0687_54c78d84:span:1847a6ad339b06d6:tool:0"| n34
  n5 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:1d5bf1efefcfd157:llm:2a21e94e0687_54c78d84:span:1d5bf1efefcfd157:tool:0"| n35
  n6 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:21599fd42654e452:llm:2a21e94e0687_54c78d84:span:21599fd42654e452:tool:0"| n36
  n7 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:273b0d68a2437493:llm:2a21e94e0687_54c78d84:span:273b0d68a2437493:tool:0"| n37
  n8 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:276b2820f06050fb:llm:2a21e94e0687_54c78d84:span:276b2820f06050fb:tool:0"| n38
  n9 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:2fb3778987d0dea9:llm:2a21e94e0687_54c78d84:span:2fb3778987d0dea9:tool:0"| n39
  n10 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:3099f3232895f9c1:llm:2a21e94e0687_54c78d84:span:3099f3232895f9c1:tool:0"| n40
  n11 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:3ac44c55b59e2e72:llm:2a21e94e0687_54c78d84:span:3ac44c55b59e2e72:tool:0"| n41
  n13 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:4436886971683add:llm:2a21e94e0687_54c78d84:span:4436886971683add:tool:0"| n42
  n14 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:49e2107b9042b65c:llm:2a21e94e0687_54c78d84:span:49e2107b9042b65c:tool:0"| n43
  n15 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:4a110ff398df43a0:llm:2a21e94e0687_54c78d84:span:4a110ff398df43a0:tool:0"| n44
  n16 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:4cc55d33ae1b8d36:llm:2a21e94e0687_54c78d84:span:4cc55d33ae1b8d36:tool:0"| n45
  n17 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:4e896bab65cf634f:llm:2a21e94e0687_54c78d84:span:4e896bab65cf634f:tool:0"| n46
  n18 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:539db7100d339b1a:llm:2a21e94e0687_54c78d84:span:539db7100d339b1a:tool:0"| n47
  n19 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:66da95225945c5fd:llm:2a21e94e0687_54c78d84:span:66da95225945c5fd:tool:0"| n48
  n20 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:7371c38211dccc19:llm:2a21e94e0687_54c78d84:span:7371c38211dccc19:tool:0"| n49
  n21 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:7b383445da75cb4b:llm:2a21e94e0687_54c78d84:span:7b383445da75cb4b:tool:0"| n50
  n22 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:87d84995b3ca4ea1:llm:2a21e94e0687_54c78d84:span:87d84995b3ca4ea1:tool:0"| n51
  n23 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:9cd14a83f32b9e32:llm:2a21e94e0687_54c78d84:span:9cd14a83f32b9e32:tool:0"| n52
  n24 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:b583cb58a87f68eb:llm:2a21e94e0687_54c78d84:span:b583cb58a87f68eb:tool:0"| n53
  n25 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:bd281276277d9bc3:llm:2a21e94e0687_54c78d84:span:bd281276277d9bc3:tool:0"| n54
  n26 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:de4198591cfd11e0:llm:2a21e94e0687_54c78d84:span:de4198591cfd11e0:tool:0"| n55
  n27 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:e0b972d19512e73e:llm:2a21e94e0687_54c78d84:span:e0b972d19512e73e:tool:0"| n56
  n28 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:e854dfefc11fe510:llm:2a21e94e0687_54c78d84:span:e854dfefc11fe510:tool:0"| n57
  n29 -->|"invokes: edge:parent:invokes:2a21e94e0687_54c78d84:span:f1f94186aafc2ba1:llm:2a21e94e0687_54c78d84:span:f1f94186aafc2ba1:tool:0"| n58
